99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/rmt/esp32_mquickjs_rmt.c
#include "esp32_mquickjs_rmt.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_RMT

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"

#include <math.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "driver/gpio.h"
#include "driver/rmt_common.h"
#include "driver/rmt_encoder.h"
#include "driver/rmt_rx.h"
#include "driver/rmt_tx.h"
#include "esp_attr.h"
#include "esp_err.h"
#include "esp_heap_caps.h"
#include "freertos/FreeRTOS.h"
#include "soc/soc_caps.h"

#define RMT_MAX_CHANNELS 8U
#define RMT_MAX_SYMBOLS 4096U
#define RMT_MAX_DURATION_TICKS 32767U
#define RMT_DEFAULT_TIMEOUT_MS 1000U

typedef enum {
    ESP32_MQUICKJS_RMT_RX,
    ESP32_MQUICKJS_RMT_TX,
} esp32_mquickjs_rmt_direction_t;

typedef enum {
    ESP32_MQUICKJS_RMT_OP_RECEIVE,
    ESP32_MQUICKJS_RMT_OP_TRANSMIT,
} esp32_mquickjs_rmt_operation_t;

typedef struct {
    rmt_symbol_word_t *symbols;
    size_t capacity;
    size_t length;
    uint16_t leases;
    bool close_pending;
} esp32_mquickjs_rmt_symbol_buffer_t;

typedef struct {
    uint8_t slot;
    uint32_t generation;
} esp32_mquickjs_rmt_channel_ref_t;

typedef struct esp32_mquickjs_future_driver_state
    esp32_mquickjs_rmt_future_state_t;

typedef struct {
    bool allocated;
    bool running;
    bool busy;
    bool release_pending;
    uint8_t index;
    uint32_t generation;
    esp32_mquickjs_rmt_direction_t direction;
    int pin;
    uint32_t resolution_hz;
    uint32_t memory_symbols;
    bool dma;
    bool invert;
    rmt_channel_handle_t handle;
    rmt_encoder_handle_t encoder;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    esp32_mquickjs_rmt_future_state_t *active;
} esp32_mquickjs_rmt_channel_slot_t;

struct esp32_mquickjs_future_driver_state {
    JSContext *ctx;
    JSGCRef channel_owner_ref;
    JSGCRef symbols_owner_ref;
    esp32_mquickjs_rmt_channel_ref_t channel_ref;
    esp32_mquickjs_rmt_symbol_buffer_t *buffer;
    esp32_mquickjs_rmt_operation_t operation;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    uint32_t timeout_ms;
    uint32_t min_pulse_ns;
    uint32_t idle_threshold_ns;
    int loop_count;
    bool end_level;
    volatile size_t received_symbols;
    volatile bool completed;
    bool buffer_leased;
    bool started;
    bool cancelled;
    bool timed_out;
    bool truncated;
    esp_err_t err;
};

static esp32_mquickjs_rmt_channel_slot_t s_rmt_channels[RMT_MAX_CHANNELS];
static uint32_t s_rmt_next_generation = 1;

static uint32_t rmt_take_generation(void)
{
    uint32_t generation = s_rmt_next_generation++;

    if (generation == 0) {
        generation = s_rmt_next_generation++;
    }
    return generation;
}

static bool rmt_to_u32(JSContext *ctx, JSValue value, uint32_t *out)
{
    double number;
    uint32_t converted;

    if (!JS_IsNumber(ctx, value) ||
        JS_ToNumber(ctx, &number, value) != 0 || !isfinite(number) ||
        number < 0 || number > UINT32_MAX) {
        return false;
    }
    converted = (uint32_t)number;
    if ((double)converted != number) {
        return false;
    }
    *out = converted;
    return true;
}

static bool rmt_to_bool(JSContext *ctx, JSValue value, bool *out)
{
    (void)ctx;
    if (!JS_IsBool(value)) {
        return false;
    }
    *out = value == JS_TRUE;
    return true;
}

static bool rmt_to_level(JSContext *ctx, JSValue value, bool *out)
{
    uint32_t level;

    if (JS_IsBool(value)) {
        *out = value == JS_TRUE;
        return true;
    }
    if (!rmt_to_u32(ctx, value, &level) || level > 1) {
        return false;
    }
    *out = level != 0;
    return true;
}

static bool rmt_string_equals(JSContext *ctx, JSValue value,
                              const char *expected)
{
    JSCStringBuf buffer;
    const char *text;

    if (!JS_IsString(ctx, value)) {
        return false;
    }
    text = JS_ToCString(ctx, value, &buffer);
    return text != NULL && strcmp(text, expected) == 0;
}

static bool rmt_is_object(JSContext *ctx, JSValue value)
{
    return JS_GetClassID(ctx, value) >= 0 && !JS_IsArray(ctx, value);
}

static esp32_mquickjs_rmt_symbol_buffer_t *rmt_symbol_buffer_from_value(
    JSContext *ctx, JSValue value, const char *api_name)
{
    esp32_mquickjs_rmt_symbol_buffer_t *buffer;

    if (JS_GetClassID(ctx, value) != JS_CLASS_RMT_SYMBOL_BUFFER) {
        JS_ThrowTypeError(ctx, "%s expects an RMTSymbolBuffer", api_name);
        return NULL;
    }
    buffer = JS_GetOpaque(ctx, value);
    if (buffer == NULL || buffer->symbols == NULL) {
        JS_ThrowReferenceError(
            ctx, "%s failed because the RMTSymbolBuffer is closed", api_name);
        return NULL;
    }
    return buffer;
}

static void rmt_symbol_buffer_release(
    esp32_mquickjs_rmt_symbol_buffer_t *buffer)
{
    if (buffer == NULL || buffer->symbols == NULL || buffer->leases != 0) {
        return;
    }
    heap_caps_free(buffer->symbols);
    buffer->symbols = NULL;
    heap_caps_free(buffer);
}

static esp32_mquickjs_rmt_channel_slot_t *rmt_channel_get_slot(
    const esp32_mquickjs_rmt_channel_ref_t *ref)
{
    esp32_mquickjs_rmt_channel_slot_t *slot;

    if (ref == NULL || ref->slot >= RMT_MAX_CHANNELS) {
        return NULL;
    }
    slot = &s_rmt_channels[ref->slot];
    if (!slot->allocated || slot->generation != ref->generation) {
        return NULL;
    }
    return slot;
}

static int rmt_channel_from_value(
    JSContext *ctx, JSValue value, const char *api_name,
    esp32_mquickjs_rmt_channel_ref_t *out_ref,
    esp32_mquickjs_rmt_channel_slot_t **out_slot)
{
    esp32_mquickjs_rmt_channel_ref_t *ref;
    esp32_mquickjs_rmt_channel_slot_t *slot;

    if (JS_GetClassID(ctx, value) != JS_CLASS_RMT_CHANNEL ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "%s expects an RMTChannel", api_name);
        return -1;
    }
    slot = rmt_channel_get_slot(ref);
    if (slot == NULL) {
        JS_ThrowReferenceError(ctx,
                               "%s failed because the RMT channel is closed",
                               api_name);
        return -1;
    }
    if (out_ref != NULL) {
        *out_ref = *ref;
    }
    if (out_slot != NULL) {
        *out_slot = slot;
    }
    return 0;
}

static void rmt_channel_cleanup(esp32_mquickjs_rmt_channel_slot_t *slot)
{
    uint8_t index;

    if (slot == NULL || !slot->allocated || slot->busy) {
        return;
    }
    index = slot->index;
    if (slot->running && slot->handle != NULL) {
        (void)rmt_disable(slot->handle);
    }
    if (slot->encoder != NULL) {
        (void)rmt_del_encoder(slot->encoder);
    }
    if (slot->handle != NULL) {
        (void)rmt_del_channel(slot->handle);
    }
    memset(slot, 0, sizeof(*slot));
    slot->index = index;
}

static void rmt_abort_active(esp32_mquickjs_rmt_channel_slot_t *slot)
{
    esp_err_t err;

    if (slot == NULL || !slot->running || slot->handle == NULL) {
        return;
    }
    (void)rmt_disable(slot->handle);
    slot->running = false;
    if (!slot->release_pending) {
        err = rmt_enable(slot->handle);
        if (err == ESP_OK) {
            slot->running = true;
        }
    }
}

static JSValue rmt_make_channel(JSContext *ctx,
                                const esp32_mquickjs_rmt_channel_slot_t *slot)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    esp32_mquickjs_rmt_channel_ref_t *ref;

