99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/rmt/esp32_mquickjs_rmt.c
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_RMT_CHANNEL);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    ref = heap_caps_malloc(sizeof(*ref), MALLOC_CAP_8BIT);
    if (ref == NULL) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowOutOfMemory(ctx);
    }
    ref->slot = slot->index;
    ref->generation = slot->generation;
    JS_SetOpaque(ctx, *object, ref);
    return JS_PopGCRef(ctx, &object_ref);
}

static JSValue rmt_symbol_object(JSContext *ctx,
                                 const rmt_symbol_word_t *symbol)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);

    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "duration0Ticks",
            JS_NewUint32(ctx, symbol->duration0)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "level0",
                                         JS_NewBool(symbol->level0)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "duration1Ticks",
            JS_NewUint32(ctx, symbol->duration1)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "level1",
                                         JS_NewBool(symbol->level1))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static bool rmt_parse_symbol(JSContext *ctx, int argc, JSValue *argv,
                             rmt_symbol_word_t *out)
{
    uint32_t duration0;
    uint32_t duration1;
    bool level0;
    bool level1;

    if (argc != 4 || !rmt_to_u32(ctx, argv[0], &duration0) ||
        !rmt_to_level(ctx, argv[1], &level0) ||
        !rmt_to_u32(ctx, argv[2], &duration1) ||
        !rmt_to_level(ctx, argv[3], &level1)) {
        JS_ThrowTypeError(
            ctx,
            "RMT symbol expects duration0Ticks, level0, duration1Ticks, level1");
        return false;
    }
    if (duration0 > RMT_MAX_DURATION_TICKS ||
        duration1 > RMT_MAX_DURATION_TICKS) {
        JS_ThrowRangeError(ctx,
                           "RMT symbol durations must fit the 15-bit tick field");
        return false;
    }
    *out = (rmt_symbol_word_t){
        .duration0 = duration0,
        .level0 = level0,
        .duration1 = duration1,
        .level1 = level1,
    };
    return true;
}

static bool IRAM_ATTR rmt_on_transmit_done(
    rmt_channel_handle_t channel, const rmt_tx_done_event_data_t *event,
    void *user_ctx)
{
    esp32_mquickjs_rmt_channel_slot_t *slot = user_ctx;
    esp32_mquickjs_rmt_future_state_t *state;
    int task_woken = pdFALSE;

    (void)channel;
    (void)event;
    if (slot != NULL && (state = slot->active) != NULL) {
        state->err = ESP_OK;
        state->completed = true;
        if (slot->runtime != NULL) {
            (void)esp32_mquickjs_future_wake_from_isr(
                slot->runtime, slot->token, &task_woken);
        }
    }
    return task_woken == pdTRUE;
}

static bool IRAM_ATTR rmt_on_receive_done(
    rmt_channel_handle_t channel, const rmt_rx_done_event_data_t *event,
    void *user_ctx)
{
    esp32_mquickjs_rmt_channel_slot_t *slot = user_ctx;
    esp32_mquickjs_rmt_future_state_t *state;
    int task_woken = pdFALSE;

    (void)channel;
    if (slot != NULL && event != NULL &&
        (state = slot->active) != NULL) {
        state->received_symbols = event->num_symbols;
        state->truncated = event->num_symbols >= state->buffer->capacity;
        state->err = ESP_OK;
        state->completed = true;
        if (slot->runtime != NULL) {
            (void)esp32_mquickjs_future_wake_from_isr(
                slot->runtime, slot->token, &task_woken);
        }
    }
    return task_woken == pdTRUE;
}

static bool rmt_parse_timeout_option(JSContext *ctx, JSValue options,
                                     uint32_t *timeout_ms)
{
    JSValue property = JS_GetPropertyStr(ctx, options, "timeoutMs");

    if (JS_IsException(property)) {
        return false;
    }
    if (!JS_IsUndefined(property) &&
        !rmt_to_u32(ctx, property, timeout_ms)) {
        JS_ThrowTypeError(ctx, "RMT timeoutMs must be a non-negative integer");
        return false;
    }
    return true;
}

static bool rmt_prepare_common(
    JSContext *ctx, JSGCRef *this_ref, JSValue symbols_value,
    esp32_mquickjs_rmt_operation_t operation,
    esp32_mquickjs_rmt_future_state_t **out_state)
{
    esp32_mquickjs_rmt_channel_slot_t *slot;
    esp32_mquickjs_rmt_symbol_buffer_t *buffer;
    esp32_mquickjs_rmt_future_state_t *state;
    JSValue *owner;

    if (rmt_channel_from_value(ctx, this_ref->val,
                               operation == ESP32_MQUICKJS_RMT_OP_TRANSMIT
                                   ? "RMTChannel.transmit()"
                                   : "RMTChannel.receive()",
                               NULL, &slot) != 0) {
        return false;
    }
    if ((operation == ESP32_MQUICKJS_RMT_OP_TRANSMIT &&
         slot->direction != ESP32_MQUICKJS_RMT_TX) ||
        (operation == ESP32_MQUICKJS_RMT_OP_RECEIVE &&
         slot->direction != ESP32_MQUICKJS_RMT_RX)) {
        JS_ThrowTypeError(ctx, "RMT operation does not match channel direction");
        return false;
    }
    if (!slot->running) {
        JS_ThrowInternalError(ctx, "RMT operation requires start() first");
        return false;
    }
    if (slot->busy) {
        JS_ThrowInternalError(ctx, "RMT channel already has a pending operation");
        return false;
    }
    buffer = rmt_symbol_buffer_from_value(
        ctx, symbols_value,
        operation == ESP32_MQUICKJS_RMT_OP_TRANSMIT
            ? "RMTChannel.transmit(symbols)"
            : "RMTChannel.receive(symbols)");
    if (buffer == NULL) {
        return false;
    }
    if (operation == ESP32_MQUICKJS_RMT_OP_TRANSMIT && buffer->length == 0) {
        JS_ThrowRangeError(ctx,
                           "RMTChannel.transmit() requires a non-empty symbol buffer");
        return false;
    }
    if (buffer->leases != 0) {
        JS_ThrowInternalError(ctx,
                              "RMTSymbolBuffer already has a pending operation");
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_INTERNAL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->channel_ref.slot = slot->index;
    state->channel_ref.generation = slot->generation;
    state->buffer = buffer;
    state->operation = operation;
    state->timeout_ms = RMT_DEFAULT_TIMEOUT_MS;
    state->err = ESP_OK;
    buffer->leases++;
    state->buffer_leased = true;
    owner = JS_AddGCRef(ctx, &state->channel_owner_ref);
    *owner = this_ref->val;
    owner = JS_AddGCRef(ctx, &state->symbols_owner_ref);
    *owner = symbols_value;
    *out_state = state;
    return true;
}

static bool rmt_transmit_prepare(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_rmt_future_state_t *state;
    JSValue options = JS_UNDEFINED;

    if (out_state == NULL || argc < 1 || argc > 2 ||
        (argc == 2 && !JS_IsUndefined(argv[1].val) &&
         !rmt_is_object(ctx, argv[1].val))) {
        JS_ThrowTypeError(
            ctx,
            "RMTChannel.transmit(symbols, options?) expects an RMTSymbolBuffer and options object");
        return false;
    }
    if (!rmt_prepare_common(ctx, this_ref, argv[0].val,
                            ESP32_MQUICKJS_RMT_OP_TRANSMIT, &state)) {
        return false;
    }
    if (argc == 2 && !JS_IsUndefined(argv[1].val)) {
        JSGCRef property_ref;
        JSValue *property = JS_PushGCRef(ctx, &property_ref);
        uint32_t loop_count;

        options = argv[1].val;
        *property = JS_GetPropertyStr(ctx, options, "loopCount");
        if (JS_IsException(*property) ||
            (!JS_IsUndefined(*property) &&
             (!rmt_to_u32(ctx, *property, &loop_count) ||
              loop_count > INT32_MAX))) {
            JS_ThrowTypeError(ctx,
                              "RMT loopCount must be a finite non-negative integer");
            JS_PopGCRef(ctx, &property_ref);
            goto fail;
        }
        if (!JS_IsUndefined(*property)) {
            state->loop_count = (int)loop_count;
        }
        *property = JS_GetPropertyStr(ctx, options, "endLevel");
        if (JS_IsException(*property) ||
            (!JS_IsUndefined(*property) &&
             !rmt_to_level(ctx, *property, &state->end_level))) {
            JS_ThrowTypeError(ctx, "RMT endLevel must be boolean, zero, or one");
            JS_PopGCRef(ctx, &property_ref);
            goto fail;
        }
        JS_PopGCRef(ctx, &property_ref);
        if (!rmt_parse_timeout_option(ctx, options, &state->timeout_ms)) {
            goto fail;
        }
    }
    *out_state = state;
    return true;

