99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/rmt/esp32_mquickjs_rmt.c
fail:
    if (state->buffer_leased && state->buffer->leases > 0) {
        state->buffer->leases--;
    }
    JS_DeleteGCRef(ctx, &state->symbols_owner_ref);
    JS_DeleteGCRef(ctx, &state->channel_owner_ref);
    heap_caps_free(state);
    return false;
}

static bool rmt_receive_prepare(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_rmt_future_state_t *state;
    JSGCRef property_ref;
    JSValue *property;

    if (out_state == NULL || argc != 2 ||
        !rmt_is_object(ctx, argv[1].val)) {
        JS_ThrowTypeError(
            ctx,
            "RMTChannel.receive(symbols, options) expects an RMTSymbolBuffer and options object");
        return false;
    }
    if (!rmt_prepare_common(ctx, this_ref, argv[0].val,
                            ESP32_MQUICKJS_RMT_OP_RECEIVE, &state)) {
        return false;
    }
    property = JS_PushGCRef(ctx, &property_ref);
    *property = JS_GetPropertyStr(ctx, argv[1].val, "minPulseNs");
    if (JS_IsException(*property) ||
        (!JS_IsUndefined(*property) &&
         !rmt_to_u32(ctx, *property, &state->min_pulse_ns))) {
        JS_ThrowTypeError(ctx, "RMT minPulseNs must be a non-negative integer");
        goto fail;
    }
    *property = JS_GetPropertyStr(ctx, argv[1].val, "idleThresholdNs");
    if (JS_IsException(*property) ||
        !rmt_to_u32(ctx, *property, &state->idle_threshold_ns) ||
        state->idle_threshold_ns == 0) {
        JS_ThrowTypeError(ctx,
                          "RMT idleThresholdNs must be a positive integer");
        goto fail;
    }
    JS_PopGCRef(ctx, &property_ref);
    if (!rmt_parse_timeout_option(ctx, argv[1].val, &state->timeout_ms)) {
        goto release;
    }
    state->buffer->length = 0;
    *out_state = state;
    return true;

fail:
    JS_PopGCRef(ctx, &property_ref);
release:
    if (state->buffer_leased && state->buffer->leases > 0) {
        state->buffer->leases--;
    }
    JS_DeleteGCRef(ctx, &state->symbols_owner_ref);
    JS_DeleteGCRef(ctx, &state->channel_owner_ref);
    heap_caps_free(state);
    return false;
}

static bool rmt_operation_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *driver_state)
{
    esp32_mquickjs_rmt_future_state_t *state = driver_state;
    esp32_mquickjs_rmt_channel_slot_t *slot =
        state != NULL ? rmt_channel_get_slot(&state->channel_ref) : NULL;

    if (state == NULL || slot == NULL || !slot->running) {
        JS_ThrowReferenceError(ctx,
                               "RMT channel closed before operation started");
        return false;
    }
    if (slot->busy) {
        JS_ThrowInternalError(ctx,
                              "RMT channel already has a pending operation");
        return false;
    }
    slot->busy = true;
    slot->runtime = runtime;
    slot->token = token;
    slot->active = state;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (state->operation == ESP32_MQUICKJS_RMT_OP_TRANSMIT) {
        rmt_transmit_config_t config = {
            .loop_count = state->loop_count,
            .flags = {
                .eot_level = state->end_level,
                .queue_nonblocking = true,
            },
        };

        state->err = rmt_transmit(
            slot->handle, slot->encoder, state->buffer->symbols,
            state->buffer->length * sizeof(rmt_symbol_word_t), &config);
    } else {
        rmt_receive_config_t config = {
            .signal_range_min_ns = state->min_pulse_ns,
            .signal_range_max_ns = state->idle_threshold_ns,
        };

        state->err = rmt_receive(
            slot->handle, state->buffer->symbols,
            state->buffer->capacity * sizeof(rmt_symbol_word_t), &config);
    }
    if (state->err != ESP_OK) {
        JS_ThrowInternalError(ctx, "RMT operation failed to start: %s",
                              esp_err_to_name(state->err));
        return false;
    }
    if (state->timeout_ms == 0) {
        rmt_abort_active(slot);
        state->timed_out = true;
        state->completed = true;
    }
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

static esp32_mquickjs_future_poll_t rmt_operation_poll(
    esp32_mquickjs_future_driver_state_t *driver_state)
{
    esp32_mquickjs_rmt_future_state_t *state = driver_state;

    return state != NULL && state->completed
               ? ESP32_MQUICKJS_FUTURE_READY
               : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue rmt_operation_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *driver_state)
{
    esp32_mquickjs_rmt_future_state_t *state = driver_state;
    JSGCRef result_ref;
    JSValue *result;

    if (state == NULL || state->cancelled) {
        return JS_ThrowInternalError(ctx, "RMT operation cancelled");
    }
    if (state->timed_out) {
        if (state->operation == ESP32_MQUICKJS_RMT_OP_RECEIVE) {
            return JS_NULL;
        }
        return JS_ThrowInternalError(ctx, "RMT transmission timed out");
    }
    if (state->err != ESP_OK) {
        return JS_ThrowInternalError(ctx, "RMT operation failed: %s",
                                     esp_err_to_name(state->err));
    }
    result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (state->operation == ESP32_MQUICKJS_RMT_OP_RECEIVE) {
        size_t length = state->received_symbols;

        if (length > state->buffer->capacity) {
            length = state->buffer->capacity;
            state->truncated = true;
        }
        state->buffer->length = length;
        if (JS_IsException(*result) ||
            !esp32_mquickjs_set_property_ref(
                ctx, result, "length", JS_NewInt64(ctx, (int64_t)length)) ||
            !esp32_mquickjs_set_property_ref(
                ctx, result, "truncated", JS_NewBool(state->truncated))) {
            JS_PopGCRef(ctx, &result_ref);
            return JS_EXCEPTION;
        }
    } else if (JS_IsException(*result) ||
               !esp32_mquickjs_set_property_ref(
                   ctx, result, "symbols",
                   JS_NewInt64(ctx, (int64_t)state->buffer->length)) ||
               !esp32_mquickjs_set_property_ref(
                   ctx, result, "loopCount",
                   JS_NewInt32(ctx, state->loop_count))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static bool rmt_operation_cancel(
    esp32_mquickjs_future_driver_state_t *driver_state)
{
    esp32_mquickjs_rmt_future_state_t *state = driver_state;
    esp32_mquickjs_rmt_channel_slot_t *slot =
        state != NULL ? rmt_channel_get_slot(&state->channel_ref) : NULL;

