99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/rmt/esp32_mquickjs_rmt.c
    if (state == NULL || state->completed) {
        return false;
    }
    if (slot != NULL && state->started) {
        rmt_abort_active(slot);
    }
    state->cancelled = true;
    state->completed = true;
    if (state->runtime != NULL) {
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    }
    return true;
}

static void rmt_operation_destroy(
    esp32_mquickjs_future_driver_state_t *driver_state)
{
    esp32_mquickjs_rmt_future_state_t *state = driver_state;
    esp32_mquickjs_rmt_channel_slot_t *slot;
    esp32_mquickjs_rmt_symbol_buffer_t *buffer;

    if (state == NULL) {
        return;
    }
    slot = rmt_channel_get_slot(&state->channel_ref);
    buffer = state->buffer;
    if (slot != NULL && state->started) {
        slot->busy = false;
        slot->runtime = NULL;
        slot->active = NULL;
        if (slot->release_pending) {
            rmt_channel_cleanup(slot);
        }
    }
    if (state->buffer_leased && buffer != NULL && buffer->leases > 0) {
        buffer->leases--;
        if (buffer->close_pending && buffer->leases == 0) {
            rmt_symbol_buffer_release(buffer);
        }
    }
    JS_DeleteGCRef(state->ctx, &state->symbols_owner_ref);
    JS_DeleteGCRef(state->ctx, &state->channel_owner_ref);
    heap_caps_free(state);
}

static uint32_t rmt_operation_timeout_ms(
    const esp32_mquickjs_future_driver_state_t *driver_state)
{
    const esp32_mquickjs_rmt_future_state_t *state = driver_state;

    return state != NULL ? state->timeout_ms : 0;
}

static const esp32_mquickjs_future_driver_t s_rmt_transmit_driver = {
    .prepare = rmt_transmit_prepare,
    .start = rmt_operation_start,
    .poll = rmt_operation_poll,
    .finish = rmt_operation_finish,
    .cancel = rmt_operation_cancel,
    .destroy = rmt_operation_destroy,
    .timeout_ms = rmt_operation_timeout_ms,
};

static const esp32_mquickjs_future_driver_t s_rmt_receive_driver = {
    .prepare = rmt_receive_prepare,
    .start = rmt_operation_start,
    .poll = rmt_operation_poll,
    .finish = rmt_operation_finish,
    .cancel = rmt_operation_cancel,
    .destroy = rmt_operation_destroy,
    .timeout_ms = rmt_operation_timeout_ms,
};

static bool rmt_register_future_drivers(JSContext *ctx,
                                        esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef object_ref;
    JSGCRef method_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    bool result;

    *object = JS_NewObjectClassUser(ctx, JS_CLASS_RMT_CHANNEL);
    *method = JS_IsException(*object)
                  ? JS_EXCEPTION
                  : JS_GetPropertyStr(ctx, *object, "transmit");
    result = !JS_IsException(*method) &&
             esp32_mquickjs_future_register_driver(
                 ctx, runtime, *method, &s_rmt_transmit_driver);
    if (result) {
        *method = JS_GetPropertyStr(ctx, *object, "receive");
        result = !JS_IsException(*method) &&
                 esp32_mquickjs_future_register_driver(
                     ctx, runtime, *method, &s_rmt_receive_driver);
    }
    if (!result && !JS_IsException(*object)) {
        JS_ThrowInternalError(ctx, "failed to register RMT Future drivers");
    }
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &object_ref);
    return result;
}

bool esp32_mquickjs_init_rmt_runtime(JSContext *ctx,
                                     esp32_mquickjs_runtime_t *runtime)
{
    uint8_t i;

    for (i = 0; i < RMT_MAX_CHANNELS; ++i) {
        if (s_rmt_channels[i].allocated && !s_rmt_channels[i].busy) {
            rmt_channel_cleanup(&s_rmt_channels[i]);
        }
        memset(&s_rmt_channels[i], 0, sizeof(s_rmt_channels[i]));
        s_rmt_channels[i].index = i;
    }
    return rmt_register_future_drivers(ctx, runtime);
}

void esp32_mquickjs_deinit_rmt_runtime(void)
{
    uint8_t i;

    for (i = 0; i < RMT_MAX_CHANNELS; ++i) {
        if (s_rmt_channels[i].allocated) {
            s_rmt_channels[i].release_pending = true;
            if (!s_rmt_channels[i].busy) {
                rmt_channel_cleanup(&s_rmt_channels[i]);
            }
        }
    }
}

JSValue js_rmt_symbol_buffer_constructor(JSContext *ctx, JSValue *this_val,
                                         int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(
        ctx, "RMTSymbolBuffer cannot be constructed directly");
}

void js_rmt_symbol_buffer_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_rmt_symbol_buffer_t *buffer = opaque;

    (void)ctx;
    if (buffer != NULL) {
        buffer->close_pending = true;
        if (buffer->leases == 0) {
            rmt_symbol_buffer_release(buffer);
        }
    }
}

JSValue js_rmt_symbol_buffer_get_capacity(JSContext *ctx, JSValue *this_val,
                                          int argc, JSValue *argv)
{
    esp32_mquickjs_rmt_symbol_buffer_t *buffer;

    (void)argc;
    (void)argv;
    buffer = rmt_symbol_buffer_from_value(ctx, *this_val,
                                          "RMTSymbolBuffer.capacity");
    return buffer == NULL ? JS_EXCEPTION
                          : JS_NewInt64(ctx, (int64_t)buffer->capacity);
}

JSValue js_rmt_symbol_buffer_get_length(JSContext *ctx, JSValue *this_val,
                                        int argc, JSValue *argv)
{
    esp32_mquickjs_rmt_symbol_buffer_t *buffer;

    (void)argc;
    (void)argv;
    buffer = rmt_symbol_buffer_from_value(ctx, *this_val,
                                          "RMTSymbolBuffer.length");
    return buffer == NULL ? JS_EXCEPTION
                          : JS_NewInt64(ctx, (int64_t)buffer->length);
}

JSValue js_rmt_symbol_buffer_push(JSContext *ctx, JSValue *this_val,
                                  int argc, JSValue *argv)
{
    esp32_mquickjs_rmt_symbol_buffer_t *buffer =
        rmt_symbol_buffer_from_value(ctx, *this_val,
                                     "RMTSymbolBuffer.push()");
    rmt_symbol_word_t symbol;

