99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/rmt/esp32_mquickjs_rmt.c
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (buffer->leases != 0) {
        return JS_ThrowInternalError(
            ctx, "RMTSymbolBuffer.push() refused while an operation is pending");
    }
    if (!rmt_parse_symbol(ctx, argc, argv, &symbol)) {
        return JS_EXCEPTION;
    }
    if (buffer->length >= buffer->capacity) {
        return JS_ThrowRangeError(ctx, "RMTSymbolBuffer capacity is exhausted");
    }
    buffer->symbols[buffer->length++] = symbol;
    return JS_NewInt64(ctx, (int64_t)buffer->length);
}

JSValue js_rmt_symbol_buffer_get(JSContext *ctx, JSValue *this_val,
                                 int argc, JSValue *argv)
{
    esp32_mquickjs_rmt_symbol_buffer_t *buffer =
        rmt_symbol_buffer_from_value(ctx, *this_val,
                                     "RMTSymbolBuffer.get()");
    uint32_t index;

    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (argc != 1 || !rmt_to_u32(ctx, argv[0], &index) ||
        index >= buffer->length) {
        return JS_ThrowRangeError(
            ctx, "RMTSymbolBuffer.get(index) expects an existing index");
    }
    return rmt_symbol_object(ctx, &buffer->symbols[index]);
}

JSValue js_rmt_symbol_buffer_set(JSContext *ctx, JSValue *this_val,
                                 int argc, JSValue *argv)
{
    esp32_mquickjs_rmt_symbol_buffer_t *buffer =
        rmt_symbol_buffer_from_value(ctx, *this_val,
                                     "RMTSymbolBuffer.set()");
    rmt_symbol_word_t symbol;
    uint32_t index;

    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (buffer->leases != 0) {
        return JS_ThrowInternalError(
            ctx, "RMTSymbolBuffer.set() refused while an operation is pending");
    }
    if (argc != 5 || !rmt_to_u32(ctx, argv[0], &index) ||
        index >= buffer->length) {
        return JS_ThrowRangeError(
            ctx,
            "RMTSymbolBuffer.set(index, ...) expects an existing index");
    }
    if (!rmt_parse_symbol(ctx, argc - 1, argv + 1, &symbol)) {
        return JS_EXCEPTION;
    }
    buffer->symbols[index] = symbol;
    return JS_TRUE;
}

JSValue js_rmt_symbol_buffer_clear(JSContext *ctx, JSValue *this_val,
                                   int argc, JSValue *argv)
{
    esp32_mquickjs_rmt_symbol_buffer_t *buffer =
        rmt_symbol_buffer_from_value(ctx, *this_val,
                                     "RMTSymbolBuffer.clear()");

    (void)argc;
    (void)argv;
    if (buffer == NULL) {
        return JS_EXCEPTION;
    }
    if (buffer->leases != 0) {
        return JS_ThrowInternalError(
            ctx, "RMTSymbolBuffer.clear() refused while an operation is pending");
    }
    buffer->length = 0;
    return JS_TRUE;
}

JSValue js_rmt_symbol_buffer_close(JSContext *ctx, JSValue *this_val,
                                   int argc, JSValue *argv)
{
    esp32_mquickjs_rmt_symbol_buffer_t *buffer;

    (void)argc;
    (void)argv;
    if (JS_GetClassID(ctx, *this_val) != JS_CLASS_RMT_SYMBOL_BUFFER) {
        return JS_ThrowTypeError(
            ctx, "RMTSymbolBuffer.close() expects an RMTSymbolBuffer");
    }
    buffer = JS_GetOpaque(ctx, *this_val);
    if (buffer == NULL) {
        return JS_TRUE;
    }
    JS_SetOpaque(ctx, *this_val, NULL);
    buffer->close_pending = true;
    if (buffer->leases == 0) {
        rmt_symbol_buffer_release(buffer);
    }
    return JS_TRUE;
}

JSValue js_rmt_channel_constructor(JSContext *ctx, JSValue *this_val,
                                   int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "RMTChannel cannot be constructed directly");
}

void js_rmt_channel_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_rmt_channel_ref_t *ref = opaque;
    esp32_mquickjs_rmt_channel_slot_t *slot = rmt_channel_get_slot(ref);

    (void)ctx;
    if (slot != NULL) {
        slot->release_pending = true;
        if (slot->busy && slot->active != NULL) {
            (void)rmt_operation_cancel(slot->active);
        } else {
            rmt_channel_cleanup(slot);
        }
    }
    heap_caps_free(ref);
}

JSValue js_rmt_channel_start(JSContext *ctx, JSValue *this_val,
                             int argc, JSValue *argv)
{
    esp32_mquickjs_rmt_channel_slot_t *slot;
    esp_err_t err;

    (void)argc;
    (void)argv;
    if (rmt_channel_from_value(ctx, *this_val, "RMTChannel.start()", NULL,
                               &slot) != 0) {
        return JS_EXCEPTION;
    }
    if (slot->running) {
        return JS_TRUE;
    }
    err = rmt_enable(slot->handle);
    if (err != ESP_OK) {
        return JS_ThrowInternalError(ctx, "RMTChannel.start() failed: %s",
                                     esp_err_to_name(err));
    }
    slot->running = true;
    return JS_TRUE;
}

JSValue js_rmt_channel_stop(JSContext *ctx, JSValue *this_val,
                            int argc, JSValue *argv)
{
    esp32_mquickjs_rmt_channel_slot_t *slot;
    esp_err_t err;

    (void)argc;
    (void)argv;
    if (rmt_channel_from_value(ctx, *this_val, "RMTChannel.stop()", NULL,
                               &slot) != 0) {
        return JS_EXCEPTION;
    }
    if (!slot->running) {
        return JS_TRUE;
    }
    if (slot->busy) {
        return JS_ThrowInternalError(
            ctx, "RMTChannel.stop() refused while an operation is pending");
    }
    err = rmt_disable(slot->handle);
    if (err != ESP_OK) {
        return JS_ThrowInternalError(ctx, "RMTChannel.stop() failed: %s",
                                     esp_err_to_name(err));
    }
    slot->running = false;
    return JS_TRUE;
}

static JSValue rmt_call_and_wait(JSContext *ctx, JSValue *this_val,
                                 const char *method_name, int argc,
                                 JSValue *argv)
{
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *method = JS_GetPropertyStr(ctx, *this_val, method_name);
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

JSValue js_rmt_channel_transmit(JSContext *ctx, JSValue *this_val,
                                int argc, JSValue *argv)
{
    return rmt_call_and_wait(ctx, this_val, "transmit", argc, argv);
}

JSValue js_rmt_channel_receive(JSContext *ctx, JSValue *this_val,
                               int argc, JSValue *argv)
{
    return rmt_call_and_wait(ctx, this_val, "receive", argc, argv);
}

