99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/rmt/esp32_mquickjs_rmt.c
JSValue js_rmt_channel_status(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    esp32_mquickjs_rmt_channel_slot_t *slot;
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);

    (void)argc;
    (void)argv;
    if (rmt_channel_from_value(ctx, *this_val, "RMTChannel.status()", NULL,
                               &slot) != 0) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "direction",
                                         JS_NewString(
                                             ctx,
                                             slot->direction ==
                                                     ESP32_MQUICKJS_RMT_TX
                                                 ? "tx"
                                                 : "rx")) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "pin",
                                         JS_NewInt32(ctx, slot->pin)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "resolutionHz",
            JS_NewUint32(ctx, slot->resolution_hz)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "memorySymbols",
            JS_NewUint32(ctx, slot->memory_symbols)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "dma",
                                         JS_NewBool(slot->dma)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "invert",
                                         JS_NewBool(slot->invert)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "running",
                                         JS_NewBool(slot->running)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "busy",
                                         JS_NewBool(slot->busy))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

JSValue js_rmt_channel_close(JSContext *ctx, JSValue *this_val,
                             int argc, JSValue *argv)
{
    esp32_mquickjs_rmt_channel_ref_t *ref;
    esp32_mquickjs_rmt_channel_slot_t *slot;

    (void)argc;
    (void)argv;
    if (JS_GetClassID(ctx, *this_val) != JS_CLASS_RMT_CHANNEL) {
        return JS_ThrowTypeError(ctx,
                                 "RMTChannel.close() expects an RMTChannel");
    }
    ref = JS_GetOpaque(ctx, *this_val);
    if (ref == NULL) {
        return JS_TRUE;
    }
    JS_SetOpaque(ctx, *this_val, NULL);
    slot = rmt_channel_get_slot(ref);
    if (slot != NULL) {
        slot->release_pending = true;
        if (slot->busy && slot->active != NULL) {
            (void)rmt_operation_cancel(slot->active);
        } else {
            rmt_channel_cleanup(slot);
        }
    }
    heap_caps_free(ref);
    return JS_TRUE;
}

JSValue js_rmt_capabilities(JSContext *ctx, JSValue *this_val,
                            int argc, JSValue *argv)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);

    (void)this_val;
    (void)argc;
    (void)argv;
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "rx", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "tx", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "dma",
#if SOC_RMT_SUPPORT_DMA
            JS_TRUE) ||
#else
            JS_FALSE) ||
#endif
        !esp32_mquickjs_set_property_ref(
            ctx, result, "minMemorySymbols",
            JS_NewUint32(ctx, SOC_RMT_MEM_WORDS_PER_CHANNEL)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "maxSymbols",
            JS_NewUint32(ctx, RMT_MAX_SYMBOLS)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "maxDurationTicks",
            JS_NewUint32(ctx, RMT_MAX_DURATION_TICKS)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "finiteLoops",
                                         JS_TRUE)) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

JSValue js_rmt_create_symbols(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    uint32_t capacity;
    esp32_mquickjs_rmt_symbol_buffer_t *buffer;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    (void)this_val;
    if (argc != 1 || !rmt_to_u32(ctx, argv[0], &capacity) || capacity == 0 ||
        capacity > RMT_MAX_SYMBOLS) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowRangeError(
            ctx,
            "rmt.createSymbols(capacity) expects 1 through 4096 symbols");
    }
    buffer = heap_caps_calloc(1, sizeof(*buffer), MALLOC_CAP_8BIT);
    if (buffer == NULL) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowOutOfMemory(ctx);
    }
    buffer->symbols = heap_caps_calloc(
        capacity, sizeof(*buffer->symbols),
        MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA | MALLOC_CAP_8BIT);
    if (buffer->symbols == NULL) {
        heap_caps_free(buffer);
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowOutOfMemory(ctx);
    }
    buffer->capacity = capacity;
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_RMT_SYMBOL_BUFFER);
    if (JS_IsException(*object)) {
        rmt_symbol_buffer_release(buffer);
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    JS_SetOpaque(ctx, *object, buffer);
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_rmt_open(JSContext *ctx, JSValue *this_val,
                    int argc, JSValue *argv)
{
    esp32_mquickjs_rmt_direction_t direction;
    uint32_t resolution_hz;
    uint32_t memory_symbols = SOC_RMT_MEM_WORDS_PER_CHANNEL;
    uint32_t raw_pin;
    bool dma = false;
    bool invert = false;
    int pin;
    esp32_mquickjs_rmt_channel_slot_t *slot = NULL;
    esp_err_t err;
    uint8_t i;
    JSValue result;

    (void)this_val;
    if (argc != 1 || !rmt_is_object(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx,
                                 "rmt.open(options) expects an options object");
    }
    {
        JSGCRef property_ref;
        JSValue *property = JS_PushGCRef(ctx, &property_ref);

        *property = JS_GetPropertyStr(ctx, argv[0], "direction");
        if (JS_IsException(*property)) {
            goto parse_fail;
        }
        if (rmt_string_equals(ctx, *property, "rx")) {
            direction = ESP32_MQUICKJS_RMT_RX;
        } else if (rmt_string_equals(ctx, *property, "tx")) {
            direction = ESP32_MQUICKJS_RMT_TX;
        } else {
            JS_ThrowTypeError(ctx,
                              "rmt.open({ direction }) expects \"rx\" or \"tx\"");
            goto parse_fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "pin");
        if (JS_IsException(*property) ||
            !rmt_to_u32(ctx, *property, &raw_pin) || raw_pin >= GPIO_NUM_MAX) {
            JS_ThrowTypeError(ctx,
                              "rmt.open({ pin }) expects a valid GPIO number");
            goto parse_fail;
        }
        pin = (int)raw_pin;
        if ((direction == ESP32_MQUICKJS_RMT_TX &&
             !GPIO_IS_VALID_OUTPUT_GPIO(pin)) ||
            (direction == ESP32_MQUICKJS_RMT_RX &&
             !GPIO_IS_VALID_GPIO(pin))) {
            JS_ThrowTypeError(ctx,
                              "rmt.open({ pin }) is invalid for the direction");
            goto parse_fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "resolutionHz");
        if (JS_IsException(*property) ||
            !rmt_to_u32(ctx, *property, &resolution_hz) ||
            resolution_hz == 0) {
            JS_ThrowTypeError(
                ctx, "rmt.open({ resolutionHz }) expects a positive integer");
            goto parse_fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "memorySymbols");
        if (JS_IsException(*property) ||
            (!JS_IsUndefined(*property) &&
             !rmt_to_u32(ctx, *property, &memory_symbols))) {
            JS_ThrowTypeError(
                ctx, "rmt.open({ memorySymbols }) expects an integer");
            goto parse_fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "dma");
        if (JS_IsException(*property) ||
            (!JS_IsUndefined(*property) &&
             !rmt_to_bool(ctx, *property, &dma))) {
            JS_ThrowTypeError(ctx, "rmt.open({ dma }) expects a boolean");
            goto parse_fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "invert");
        if (JS_IsException(*property) ||
            (!JS_IsUndefined(*property) &&
             !rmt_to_bool(ctx, *property, &invert))) {
            JS_ThrowTypeError(ctx, "rmt.open({ invert }) expects a boolean");
            goto parse_fail;
        }
        JS_PopGCRef(ctx, &property_ref);
        goto parsed;

