99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/rmt/esp32_mquickjs_rmt.c
parse_fail:
        JS_PopGCRef(ctx, &property_ref);
        return JS_EXCEPTION;
    }

parsed:
    if (memory_symbols < SOC_RMT_MEM_WORDS_PER_CHANNEL ||
        memory_symbols > RMT_MAX_SYMBOLS || (memory_symbols & 1U) != 0) {
        return JS_ThrowRangeError(
            ctx,
            "RMT memorySymbols must be even and within the target memory limits");
    }
#if !SOC_RMT_SUPPORT_DMA
    if (dma) {
        return JS_ThrowInternalError(
            ctx, "RMT DMA is unavailable on this target");
    }
#endif
    for (i = 0; i < RMT_MAX_CHANNELS; ++i) {
        if (!s_rmt_channels[i].allocated) {
            slot = &s_rmt_channels[i];
            break;
        }
    }
    if (slot == NULL) {
        return JS_ThrowInternalError(ctx,
                                     "rmt.open() found no free channel slots");
    }
    slot->allocated = true;
    slot->generation = rmt_take_generation();
    slot->direction = direction;
    slot->pin = pin;
    slot->resolution_hz = resolution_hz;
    slot->memory_symbols = memory_symbols;
    slot->dma = dma;
    slot->invert = invert;
    if (direction == ESP32_MQUICKJS_RMT_TX) {
        rmt_tx_channel_config_t config = {
            .gpio_num = (gpio_num_t)pin,
            .clk_src = RMT_CLK_SRC_DEFAULT,
            .resolution_hz = resolution_hz,
            .mem_block_symbols = memory_symbols,
            .trans_queue_depth = 1,
            .flags = {
                .invert_out = invert,
                .with_dma = dma,
            },
        };
        rmt_tx_event_callbacks_t callbacks = {
            .on_trans_done = rmt_on_transmit_done,
        };
        rmt_copy_encoder_config_t encoder_config = {};

        err = rmt_new_tx_channel(&config, &slot->handle);
        if (err == ESP_OK) {
            err = rmt_new_copy_encoder(&encoder_config, &slot->encoder);
        }
        if (err == ESP_OK) {
            err = rmt_tx_register_event_callbacks(slot->handle, &callbacks,
                                                   slot);
        }
    } else {
        rmt_rx_channel_config_t config = {
            .gpio_num = (gpio_num_t)pin,
            .clk_src = RMT_CLK_SRC_DEFAULT,
            .resolution_hz = resolution_hz,
            .mem_block_symbols = memory_symbols,
            .flags = {
                .invert_in = invert,
                .with_dma = dma,
            },
        };
        rmt_rx_event_callbacks_t callbacks = {
            .on_recv_done = rmt_on_receive_done,
        };

        err = rmt_new_rx_channel(&config, &slot->handle);
        if (err == ESP_OK) {
            err = rmt_rx_register_event_callbacks(slot->handle, &callbacks,
                                                   slot);
        }
    }
    if (err != ESP_OK) {
        rmt_channel_cleanup(slot);
        return JS_ThrowInternalError(ctx, "rmt.open() failed: %s",
                                     esp_err_to_name(err));
    }
    result = rmt_make_channel(ctx, slot);
    if (JS_IsException(result)) {
        rmt_channel_cleanup(slot);
    }
    return result;
}

#endif
